Backend/loadtest/k6/results/redis/auth/report-2026-07-29-234753.txt
     ✓ register status is 201
     ✓ login status is 200

     checks.........................: 100.00% ✓ 1680      ✗ 0   
     data_received..................: 1.3 MB  19 kB/s
     data_sent......................: 556 kB  7.8 kB/s
     http_req_blocked...............: avg=32.12µs  min=0s      med=0s       max=10.67ms  p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=17.5µs   min=0s      med=0s       max=1.88ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=105.88ms min=77.02ms med=112.7ms  max=737.83ms p(90)=129.23ms p(95)=137.34ms
       { expected_response:true }...: avg=105.88ms min=77.02ms med=112.7ms  max=737.83ms p(90)=129.23ms p(95)=137.34ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 1680
     http_req_receiving.............: avg=51.25µs  min=0s      med=0s       max=3.2ms    p(90)=0s       p(95)=541.33µs
     http_req_sending...............: avg=13.2µs   min=0s      med=0s       max=3.57ms   p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=105.81ms min=77.02ms med=112.63ms max=737.18ms p(90)=128.98ms p(95)=137.04ms
     http_reqs......................: 1680    23.55643/s
     iteration_duration.............: avg=2.21s    min=2.18s   med=2.2s     max=2.83s    p(90)=2.22s    p(95)=2.23s   
     iterations.....................: 840     11.778215/s
     vus............................: 3       min=1       max=50
     vus_max........................: 50      min=50      max=50